task3_openfoam/karmanvortexstreet/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          20;
        startFace       3840;
    }
    outlet
    {
        type            patch;
        nFaces          20;
        startFace       3860;
    }
    obstacle
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          16;
        startFace       3880;
    }
    upperWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          100;
        startFace       3896;
    }
    lowerWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          100;
        startFace       3996;
    }
    frontAndBack
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          3968;
        startFace       4096;
    }
)

// ************************************************************************* //
